//Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
//и проверяет, является ли этот день выходным.
int n = new Random().Next(1,7);
Console.WriteLine(n);
if (n==1)
Console.WriteLine("нет");
if (n==2)
Console.WriteLine("нет");
if (n==3)
Console.WriteLine("нет");
if (n==4)
Console.WriteLine("нет");
if (n==5)
Console.WriteLine("нет");
if (n==6)
Console.WriteLine("да");
